Tests/fixtures/invoices/mark_failed-200.xml

HTTP/1.1 200 OK
Content-Type: application/xml; charset=utf-8

<?xml version="1.0" encoding="UTF-8"?>
<invoice href="https://api.recurly.com/v2/invoices/abcdef1234567890">
  <account href="https://api.recurly.com/v2/accounts/1"/>
  <uuid>012345678901234567890123456789aa</uuid>
  <state>failed</state>
  <invoice_number type="integer">abcdef1234567890</invoice_number>
  <po_number nil="nil"></po_number>
  <vat_number nil="nil"></vat_number>
  <subtotal_in_cents type="integer">2995</subtotal_in_cents>
  <tax_in_cents type="integer">0</tax_in_cents>
  <total_in_cents type="integer">2995</total_in_cents>
  <currency>USD</currency>
  <created_at type="datetime">2012-05-28T17:44:13Z</created_at>
  <line_items type="array">
    <adjustment href="https://api.recurly.com/v2/adjustments/190357944dad4d461272774dd184a17e" type="charge">
      <account href="https://api.recurly.com/v2/accounts/1"/>
      <invoice href="https://api.recurly.com/v2/invoices/abcdef1234567890"/>
      <uuid>012345678901234567890123456789ab</uuid>
      <state>invoiced</state>
      <description>Silver Plan</description>
      <accounting_code></accounting_code>
      <origin>plan</origin>
      <unit_amount_in_cents type="integer">2995</unit_amount_in_cents>
      <quantity type="integer">1</quantity>
      <discount_in_cents type="integer">0</discount_in_cents>
      <tax_in_cents type="integer">0</tax_in_cents>
      <total_in_cents type="integer">2995</total_in_cents>
      <currency>USD</currency>
      <taxable type="boolean">false</taxable>
      <start_date type="datetime">2012-05-28T17:44:13Z</start_date>
      <end_date type="datetime">2013-05-28T17:44:13Z</end_date>
      <created_at type="datetime">2012-05-28T17:44:13Z</created_at>
    </adjustment>
  </line_items>
  <transactions type="array">
  </transactions>
</invoice>
